{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim.git"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session.git"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer.git"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp.git"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path.git"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip.git"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim.git"
    },
    "cyberdream.nvim": {
      "src": "https://github.com/scottmckendry/cyberdream.nvim.git"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim.git"
    },
    "flutter-tools.nvim": {
      "src": "https://github.com/nvim-flutter/flutter-tools.nvim.git"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets.git"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "leetcode.nvim": {
      "src": "https://github.com/kawre/leetcode.nvim.git"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim.git"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim.git"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim.git"
    },
    "mason-nvim-dap.nvim": {
      "src": "https://github.com/jay-babu/mason-nvim-dap.nvim.git"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim.git"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim.git"
    },
    "neodev.nvim": {
      "src": "https://github.com/folke/neodev.nvim.git"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim.git"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim.git"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs.git"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp.git"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap.git"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui.git"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text.git"
    },
    "nvim-jdtls": {
      "src": "https://github.com/mfussenegger/nvim-jdtls.git"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint.git"
    },
    "nvim-lsp-file-operations": {
      "src": "https://github.com/antosha417/nvim-lsp-file-operations.git"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig.git"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio.git"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround.git"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter.git"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context.git"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag.git"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring.git"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons.git"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim.git"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim.git"
    },
    "telescope-dap.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-dap.nvim.git"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim.git"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim.git"
    },
    "vim-dadbod": {
      "src": "https://github.com/tpope/vim-dadbod.git"
    },
    "vim-dadbod-completion": {
      "src": "https://github.com/kristijanhusak/vim-dadbod-completion.git"
    },
    "vim-dadbod-ui": {
      "src": "https://github.com/kristijanhusak/vim-dadbod-ui.git"
    },
    "vim-maximizer": {
      "src": "https://github.com/szw/vim-maximizer.git"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator.git"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim.git"
    },
    "windsurf.nvim": {
      "src": "https://github.com/Exafunction/windsurf.nvim.git"
    }
  }
}
